OpenFOAM_Validation/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    object          blockMeshDict;
}

#include "gridIndependence"

scale           1;

vertices        ( ( 0 0 0 ) ( 0.614 0 0 ) ( 0.614 1 0 ) ( 0 1 0 ) ( 0 0 0.01 ) ( 0.614 0 0.01 ) ( 0.614 1 0.01 ) ( 0 1 0.01 ) );

blocks          ( hex ( 0 1 2 3 4 5 6 7 ) ( $xmesh $ymesh 1 ) simpleGrading (1 (5 0.2) 1));

edges           ( );

boundary        ( top { type wall ; faces ( ( 3 7 6 2 ) ) ; } bottom { type wall ; faces ( ( 1 5 4 0 ) ) ; } left { type symmetryPlane ; faces ( ( 0 4 7 3 ) ) ; } right { type symmetryPlane ; faces ( ( 2 6 5 1 ) ) ; } frontAndBack { type empty ; faces ( ( 0 3 2 1 ) ( 4 5 6 7 ) ) ; } );

xmesh           40;

ymesh           326;


// ************************************************************************* //
