OpenFOAM_Validation/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          93;
        startFace       27842;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          93;
        startFace       27935;
    }
    left
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          151;
        startFace       28028;
    }
    right
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          151;
        startFace       28179;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          28086;
        startFace       28330;
    }
)

// ************************************************************************* //
