OpenFOAM_Validation/0/chargeDensity
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    class           volScalarField;
    object          rho;
}

dimensions      [ 0 -3 1 0 0 1 0 ];

internalField   uniform 3.29335e-09;

boundaryField
{
    left
    {
        type            symmetryPlane;
    }
    right
    {
        type            symmetryPlane;
    }
    bottom
    {
        type            fixedValue;
        value           uniform 6.5867e-11;
    }
    top
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
