OpenFOAM_Validation/0/potentialDifference
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    class           volScalarField;
    object          phi;
}

dimensions      [ 1 2 -3 0 0 -1 0 ];

internalField   uniform 0;

boundaryField
{
    left
    {
        type            symmetryPlane;
    }
    right
    {
        type            symmetryPlane;
    }
    bottom
    {
        type            fixedValue;
        value           uniform 74.3924;
    }
    top
    {
        type            fixedValue;
        value           uniform 0;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
