OpenFOAM_Validation/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         fourth;

}

divSchemes
{
    default         Gauss linear;
    div(phi,U)      bounded Gauss QUICK;

    div(phi,nuTilda) bounded Gauss linearUpwind grad(nuTilda);

    div((nuEff*dev2(T(grad(U))))) Gauss linear;
    div(potentialDifferenceFlux,chargeDensity)	Gauss vanLeer;
}

laplacianSchemes
{
    default         Gauss linear corrected;
    laplacian(potentialDifference)  Gauss upwind;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

wallDist
{
    method          meshWave;
}

// ************************************************************************* //
