OpenFOAM_Validation/system/probeFunctions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      probeFunctions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //




probes
{
    name    probes;
    type    probes;

    libs    (sampling);

    writeControl   timeStep;
    writeInterval  1;

    probeLocations
    (
        (0.4 0.05 0)
        (0.55 0.55 0)
        (0.55 0.02 0)
    );

    fields
    (
        chargeDensity p potentialDifference U
    );
}

